<script setup lang="ts">
import { onMounted } from 'vue';

const company = "株式会社CLIP";

onMounted(() => {
    document.title = "当サイトについて";
})
</script>
<template>
    <v-container>
        <div class="about__us">
            <h4>目的</h4>
            <p>
                <span>当サイトは、Web制作者に向けて、Vue.js関連のツールの利用方法等をわかりやすく解説することを目的としています。</span>
            </p>
            <h4>提供するコンテンツ</h4>
            <p>
                <span>特徴1: Vue.jsを使用したタイピングゲームの作成</span><br>
                <span>特徴2: おすすめのツール・サービスの紹介</span><br>
                <span>特徴3: 最新のWEBトレンド情報の紹介</span><br>
            </p>
            <h4>ご利用にあたって</h4>
            <p>
                <span>当サイトは {{ company }}（以下「当社」といいます）が管理・運営しております。</span><br>
                <span>当サイトの利用にあたっては、下記の各内容をお読みいただき、これらに同意された場合のみご利用ください。</span><br>
                <span> なお、内容につきましては、予告なしに変更することがありますので、常に最新の内容をご確認いただきますようお願い申し上げます。</span>
            </p>
            <h4>推奨環境について</h4>
            <p>
                当サイトのご利用にあたっては、ご使用のブラウザにより不具合が生じる場合がございますので、以下のブラウザ、バージョンでのご利用をお勧めいたします。
                推奨環境以外でのご利用の場合や、推奨環境下でもお客様のブラウザの設定によっては、ご利用できない、もしくは正しく表示されない場合がございます。
            </p>

            <h5>推奨OS</h5>
            <p>
                Windows: 10 以降<br>
                Macintosh: OS X 以降<br>
            </p>
            <h5>推奨ブラウザ</h5>
            <p>
                Windows: Firefox最新 / Google Chrome最新 / Microsoft Edge最新<br>
                Macintosh: Firefox最新 / Google Chrome最新<br>
            </p>


            <h5>クッキーの設定</h5>
            <p>
                当サイトではウェブサイトのサービス改善のためCookie（クッキー）を使用しています。<br>
                お客様はご利用のブラウザの設定からCookieの使用拒否や使用のたびに確認などの設定をおこなうことができます。またすでに保存されているCookieを削除することも可能です。ただし、Cookieの使用が無効になっている場合やCookieが利用できないブラウザは正しくページを表示できない場合がございますのでご留意ください。<br>
                Cookieの使用許可の設定は各ブラウザの設定からおこなうことができます。詳細はご利用のブラウザのヘルプをご確認ください。<br>
                また、当サイトでは株式会社GoogleやLINEヤフー株式会社などの第三者が提供する広告配信サービスを利用するため、当該第三者がCookieなどによってユーザーのサービスページへの訪問・行動履歴等、個人が特定出来ない属性情報を取得している場合があります。当該第三者によって取得された訪問・行動履歴情報は、当該第三者のプライバシーポリシーに従って取り扱われます。<br>
                ユーザーは、第三者が提供する広告サービスのオプトアウト手段により、取得された訪問・行動履歴情報の広告配信への利用を停止できます。<br>
                当サイトで利用している第三者のプライバシーポリシーおよびオプトアウトの方法については以下の各項目をクリックしてご確認ください。<br>
            </p>
            <h6> ■Google（広告）</h6>
            <p>
                プライバシーポリシー<br>
                オプトアウト設定（マイ アドセンター）<br>
            </p>
            <h6>■Google（Google Analytics）</h6>
            <p>
                プライバシーポリシー<br>
                オプトアウト アドオン<br>
            </p>

            <h6>■Yahoo</h6>
            <p>
                プライバシーポリシー<br>
                オプトアウト方法<br>
            </p>

            <h6>■Meta</h6>
            <p>
                プライバシーポリシー<br>
                オプトアウト方法<br>
            </p>

            <h6>■Juicer</h6>
            <p>
                プライバシーポリシー、オプトアウト方法<br>
            </p>

            <h5>JavaScriptの設定</h5>
            <p>
                当サイトでは各ページにJavaScriptの記述を含んでいます。<br>
                JavaScriptに対応していないブラウザや設定が無効になっている場合は正しくページを表示できません。<br>
                ブラウザにてJavaScriptの利用を有効に設定してご利用ください。<br>
            </p>

            <h4>著作権について</h4>
            <p>
                <span>当サイトに掲載されているすべての情報（文章・写真・動画・ソフトウェア等）は、当社もしくは当社に利用を認めた権利者が著作権を保有しています。事前の許可なく当サイトにあるコンテンツを転用・掲載することは固くお断りいたします。</span>
            </p>

            <h4>免責事項</h4>
            <p>
                当社は予告なしに当サイト上の情報を変更、削除させていただくことがあります。あらかじめ御了承ください。<br>
                なお、当社は細心の注意を払って当サイトを管理運営しておりますが、情報及び動作の正確性、安全性を保証するものではありません。<br>
                また、当サイトを利用したこと、利用できなかったことによって生じるいかなる損害についても、当社は一切の責任を負いません。<br>
            </p>
            <h4>お問い合わせ</h4>
            <p>
                残念ながら、現在お問い合わせは受け付けておりません。<br>
                ご利用の際は、自己責任にてお願いいたします。<br>
            </p>
        </div>
    </v-container>
</template>
<style scoped></style>